Revit 2022 API
FabricationService.GetGroupName Method
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `GetPaletteName` method instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute]
public string GetGroupName(
	int group
)
Visual Basic
<ObsoleteAttribute> _
Public Function GetGroupName ( _
	group As Integer _
) As String
Visual C++
[ObsoleteAttribute]
public:
String^ GetGroupName(
	int group
)
Parameters
group
Type: System.Int32
 The index of the group.
Return Value
 The name of the group.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  the index group is not larger or equal to 0 and less than PaletteCount
See Also
FabricationService Class
Autodesk.Revit.DB Namespace